ruby-memo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>Rubyメモ</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Rubyメモ"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-05-01 00:34:15 JST"/>
<meta name="author" content="Yuuhi"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="org-mode.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Rubyメモ</h1>


<meta content='no-cache' http-equiv='Pragma' />


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Rubyでxmlを操作する</a></li>
<li><a href="#sec-2">2 RubyでMySQLのデータベースにINSERT</a>
<ul>
<li><a href="#sec-2-1">2.1 文字コード</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Rubyでxmlを操作する</h2>
<div class="outline-text-2" id="text-1">


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> RubyでMySQLのデータベースにINSERT</h2>
<div class="outline-text-2" id="text-2">




<pre class="src src-ruby"><span class="linenr"> 1:  </span><span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">-*- coding: utf-8 -*-</span>
<span class="linenr"> 2:  </span>require <span style="color: #ffa07a;">"rexml/document"</span>
<span class="linenr"> 3:  </span>require <span style="color: #ffa07a;">'rexml/streamlistener'</span>
<span class="linenr"> 4:  </span>require <span style="color: #ffa07a;">"pp"</span>
<span class="linenr"> 5:  </span>
<span class="linenr"> 6:  </span>xml_file_name = <span style="color: #ffa07a;">"yuuhi.xml"</span>
<span class="linenr"> 7:  </span>
<span class="linenr"> 8:  </span>doc = <span style="color: #eedd82;">nil</span>
<span class="linenr"> 9:  </span>
<span class="linenr">10:  </span><span style="color: #00ffff;">class</span> <span style="color: #98fb98;">TextListener</span>
<span class="linenr">11:  </span>  include <span style="color: #98fb98;">REXML</span>::<span style="color: #98fb98;">StreamListener</span>
<span class="linenr">12:  </span>
<span class="linenr">13:  </span>  <span style="color: #00ffff;">def</span> <span style="color: #87cefa;">initialize</span>(stmt)
<span class="linenr">14:  </span>    <span style="color: #eedd82;">@tweet</span> = {}
<span class="linenr">15:  </span>    <span style="color: #eedd82;">@stmt</span> = stmt
<span class="linenr">16:  </span>    <span style="color: #eedd82;">@stack</span> = []
<span class="linenr">17:  </span>  <span style="color: #00ffff;">end</span>
<span class="linenr">18:  </span>
<span class="linenr">19:  </span>  <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">attrs &#12495;&#12483;&#12471;&#12517;</span>
<span class="linenr">20:  </span>  <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#23646;&#24615;&#12364;&#12394;&#12356;&#12392;&#12365;&#12399;&#12289;{}</span>
<span class="linenr">21:  </span>  <span style="color: #00ffff;">def</span> <span style="color: #87cefa;">tag_start</span>(name, attrs)
<span class="linenr">22:  </span>    <span style="color: #eedd82;">@stack</span>.push name
<span class="linenr">23:  </span>  <span style="color: #00ffff;">end</span>
<span class="linenr">24:  </span>
<span class="linenr">25:  </span>  <span style="color: #00ffff;">def</span> <span style="color: #87cefa;">tag_end</span>(name)
<span class="linenr">26:  </span>    <span style="color: #eedd82;">@stmt</span>.execute <span style="color: #eedd82;">@tweet</span>[<span style="color: #ffa07a;">'id'</span>], <span style="color: #eedd82;">@tweet</span>[<span style="color: #ffa07a;">'time'</span>], <span style="color: #eedd82;">@tweet</span>[<span style="color: #ffa07a;">'text'</span>] <span style="color: #00ffff;">if</span> name == <span style="color: #ffa07a;">'tweet'</span>
<span class="linenr">27:  </span>    <span style="color: #eedd82;">@stack</span>.pop
<span class="linenr">28:  </span>  <span style="color: #00ffff;">end</span>
<span class="linenr">29:  </span>
<span class="linenr">30:  </span>  <span style="color: #00ffff;">def</span> <span style="color: #87cefa;">text</span>(content)
<span class="linenr">31:  </span>    <span style="color: #00ffff;">if</span> <span style="color: #eedd82;">@stack</span>.last == <span style="color: #ffa07a;">'id'</span>
<span class="linenr">32:  </span>      <span style="color: #eedd82;">@tweet</span>[<span style="color: #ffa07a;">'id'</span>] = content
<span class="linenr">33:  </span>      puts <span style="color: #ffa07a;">"id: </span><span style="color: #eedd82;">#{content}</span><span style="color: #ffa07a;">"</span>
<span class="linenr">34:  </span>    <span style="color: #00ffff;">end</span>
<span class="linenr">35:  </span>    <span style="color: #00ffff;">if</span> <span style="color: #eedd82;">@stack</span>.last == <span style="color: #ffa07a;">'time'</span>
<span class="linenr">36:  </span>      <span style="color: #eedd82;">@tweet</span>[<span style="color: #ffa07a;">'time'</span>] = content
<span class="linenr">37:  </span>      puts <span style="color: #ffa07a;">"time: </span><span style="color: #eedd82;">#{content}</span><span style="color: #ffa07a;">"</span>
<span class="linenr">38:  </span>    <span style="color: #00ffff;">end</span>
<span class="linenr">39:  </span>    <span style="color: #00ffff;">if</span> <span style="color: #eedd82;">@stack</span>.last == <span style="color: #ffa07a;">'text'</span>
<span class="linenr">40:  </span>      <span style="color: #eedd82;">@tweet</span>[<span style="color: #ffa07a;">'text'</span>] = content
<span class="linenr">41:  </span>      puts <span style="color: #ffa07a;">"text: </span><span style="color: #eedd82;">#{content}</span><span style="color: #ffa07a;">"</span>
<span class="linenr">42:  </span>    <span style="color: #00ffff;">end</span>
<span class="linenr">43:  </span>  <span style="color: #00ffff;">end</span>
<span class="linenr">44:  </span><span style="color: #00ffff;">end</span>
<span class="linenr">45:  </span>
<span class="linenr">46:  </span>require <span style="color: #ffa07a;">'mysql'</span>
<span class="linenr">47:  </span>mysql = <span style="color: #98fb98;">Mysql</span>.new <span style="color: #ffa07a;">"localhost"</span>, <span style="color: #ffa07a;">"username"</span>, <span style="color: #ffa07a;">"password"</span>, <span style="color: #ffa07a;">"database_name"</span>
<span class="linenr">48:  </span>
<span class="linenr">49:  </span>mysql.query <span style="color: #ffa07a;">"SET NAMES utf8; "</span>
<span class="linenr">50:  </span>mysql.query <span style="color: #ffa07a;">"DROP TABLE IF EXISTS tweets; "</span>
<span class="linenr">51:  </span>mysql.query &lt;&lt;<span style="color: #ffa07a;">'EOQ'</span>
<span class="linenr">52:  </span><span style="color: #ffa07a;">CREATE TABLE tweets (</span>
<span class="linenr">53:  </span><span style="color: #ffa07a;">id integer NOT NULL PRIMARY KEY AUTO_INCREMENT,</span>
<span class="linenr">54:  </span><span style="color: #ffa07a;">status_id varchar(25) NOT NULL,</span>
<span class="linenr">55:  </span><span style="color: #ffa07a;">time varchar(25) NOT NULL,</span>
<span class="linenr">56:  </span><span style="color: #ffa07a;">text varchar(150) NOT NULL</span>
<span class="linenr">57:  </span><span style="color: #ffa07a;">) DEFAULT CHARACTER SET utf8;</span>
<span class="linenr">58:  </span><span style="color: #ffa07a;">EOQ</span>
<span class="linenr">59:  </span>
<span class="linenr">60:  </span>stmt = mysql.prepare <span style="color: #ffa07a;">"INSERT INTO tweets (status_id, time, text) VALUES (?,?,?) "</span>
<span class="linenr">61:  </span>
<span class="linenr">62:  </span>textListener = <span style="color: #98fb98;">TextListener</span>.new(stmt)
<span class="linenr">63:  </span><span style="color: #98fb98;">File</span>.open(xml_file_name) {|xml_file|
<span class="linenr">64:  </span>  <span style="color: #98fb98;">REXML</span>::<span style="color: #98fb98;">Parsers</span>::<span style="color: #98fb98;">StreamParser</span>.new(xml_file, textListener).parse
<span class="linenr">65:  </span>}
</pre>



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 文字コード</h3>
<div class="outline-text-3" id="text-2-1">




<pre class="src src-ruby">str.force_encoding(<span style="color: #ffa07a;">"UTF-8"</span>).encode(<span style="color: #ffa07a;">'UTF-8'</span>).encode(<span style="color: #ffa07a;">"UTF-16"</span>, <span style="color: #7fffd4;">:invalid</span> =&gt; <span style="color: #7fffd4;">:replace</span>, <span style="color: #7fffd4;">:replace</span> =&gt; <span style="color: #ffa07a;">''</span>).encode(<span style="color: #ffa07a;">"UTF-8"</span>)
</pre>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-05-01 00:34:15 JST</p>
<p class="author">Author: Yuuhi</p>
<p class="creator">Org version 7.8.03 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
